In [1]:
import ipynb_importer
%run pg_00_common.ipynb
cursor = pg_connect()

In [2]:
sql = """
SELECT
  film_id, 
  title 
FROM
  film 
WHERE
  film_id in (1, 2, 3);
"""

run_sql(cursor, sql)

   film_id             title
0        1  Academy Dinosaur
1        2    Ace Goldfinger
2        3  Adaptation Holes

In [3]:
sql = """
SELECT 
  first_name, 
  last_name
FROM 
  actor 
WHERE 
  last_name IN ('Allen', 'Chase', 'Davis') 
ORDER BY 
  last_name;
"""

run_sql(cursor, sql)

  first_name last_name
0      Meryl     Allen
1       Cuba     Allen
2        Kim     Allen
3        Jon     Chase
4         Ed     Chase
5      Susan     Davis
6   Jennifer     Davis
7      Susan     Davis

In [4]:
sql = """
SELECT 
  payment_id, 
  amount, 
  payment_date 
FROM 
  payment 
WHERE 
  payment_date::date IN ('2007-02-15', '2007-02-16');
"""

run_sql(cursor, sql)

     payment_id amount               payment_date
0         17503   7.99 2007-02-15 22:25:46.996577
1         17504   1.99 2007-02-16 17:23:14.996577
2         17505   7.99 2007-02-16 22:41:45.996577
3         17512   4.99 2007-02-16 00:10:50.996577
4         17513   6.99 2007-02-16 01:15:33.996577
..          ...    ...                        ...
585       19492   2.99 2007-02-16 01:14:54.996577
586       19499   4.99 2007-02-15 00:55:33.996577
587       19505   5.99 2007-02-15 06:44:32.996577
588       19509   4.99 2007-02-15 04:44:02.996577
589       19510   4.99 2007-02-15 11:17:28.996577

[590 rows x 3 columns]

In [5]:
sql = """
SELECT 
  film_id, 
  title 
FROM 
  film 
WHERE 
  film_id NOT IN (1, 2, 3) 
ORDER BY 
  film_id;
"""

run_sql(cursor, sql)

     film_id              title
0          4   Affair Prejudice
1          5        African Egg
2          6       Agent Truman
3          7    Airplane Sierra
4          8    Airport Pollock
..       ...                ...
992      996     Young Language
993      997         Youth Kick
994      998       Zhivago Core
995      999  Zoolander Fiction
996     1000          Zorro Ark

[997 rows x 2 columns]

```
value BETWEEN low AND high;
```

```
value NOT BETWEEN low AND high
```

In [6]:
sql = """
SELECT 
  payment_id, 
  amount 
FROM 
  payment 
WHERE 
  payment_id BETWEEN 17503 AND 17505 
ORDER BY 
  payment_id;
"""

run_sql(cursor, sql)

   payment_id amount
0       17503   7.99
1       17504   1.99
2       17505   7.99

In [7]:
sql = """
SELECT 
  payment_id, 
  amount 
FROM 
  payment 
WHERE 
  payment_id NOT BETWEEN 17503 AND 17505 
ORDER BY 
  payment_id;
"""

run_sql(cursor, sql)

       payment_id amount
0           17506   2.99
1           17507   7.99
2           17508   5.99
3           17509   5.99
4           17510   5.99
...           ...    ...
14588       32094   2.99
14589       32095   0.99
14590       32096   4.99
14591       32097   0.99
14592       32098   2.99

[14593 rows x 2 columns]

In [8]:
sql = """
SELECT 
  payment_id, 
  amount, 
  payment_date 
FROM 
  payment 
WHERE 
  payment_date BETWEEN '2007-02-15' AND '2007-02-20' 
  AND amount > 10 
ORDER BY 
  payment_date;
"""

run_sql(cursor, sql)

   payment_id amount               payment_date
0       18640  10.99 2007-02-15 08:14:59.996577
1       18272  10.99 2007-02-15 16:59:12.996577
2       18175  10.99 2007-02-16 13:20:28.996577
3       18367  10.99 2007-02-17 02:33:38.996577
4       19481  10.99 2007-02-17 16:37:30.996577
5       18035  10.99 2007-02-18 07:01:49.996577
6       19336  10.99 2007-02-19 09:18:28.996577

```
value LIKE pattern
```
or 
```
value NOT LIKE pattern
```

PG 提供两个通配符：
- %: 匹配任何零个或多个字符的序列
- _: 匹配任何单个字符


除了 `LIKE` 之外，还包括扩展的：
- ILIKE: 允许不区分大小写匹配

```
~~: LIKE
~~*: ILIKE
!~~: NOT LIKE
!~~*: NOT ILIKE
```

In [10]:
sql = """
SELECT 
  first_name, 
  last_name 
FROM 
  customer 
WHERE 
  first_name LIKE 'Jen%';
"""

# 以 Jen 开头。

run_sql(cursor, sql)

  first_name last_name
0   Jennifer     Davis
1     Jennie     Terry
2      Jenny    Castro

In [11]:
sql = """
SELECT 
  first_name, 
  last_name 
FROM 
  customer 
WHERE 
  first_name LIKE '%er%' 
ORDER BY 
  first_name;
"""

run_sql(cursor, sql)

     first_name    last_name
0        Albert       Crouse
1       Alberto      Henning
2     Alexander      Fennell
3         Amber        Dixon
4       Bernard        Colby
5       Bernice       Willis
6        Bertha     Ferguson
7       Beverly       Brooks
8     Catherine     Campbell
9        Cheryl       Murphy
10      Chester       Benner
11  Christopher        Greco
12        Derek      Blakely
13      Derrick      Bourque
14        Elmer          Noe
15       Esther     Crawford
16      Everett        Banda
17     Fernando    Churchill
18    Frederick       Isbell
19       Gerald        Fultz
20    Geraldine      Perkins
21     Gertrude     Castillo
22      Gilbert       Sledge
23      Heather       Morris
24      Herbert       Kruger
25       Herman       Devore
26       Javier        Elrod
27      Jeffery       Pinson
28     Jennifer        Davis
29       Jeremy      Hurtado
30       Jerome       Kenyon
31        Jerry       Jordon
32    Katherine       Rivera
33     Kimberly          Lee
34        Leroy   Bustamante
35       Lester        Kraus
36        Perry     Swafford
37        Peter       Menard
38       Robert     Baughman
39      Roberta       Harper
40      Roberto           Vu
41        Roger  Quintanilla
42       Sergio    Stanfield
43       Sherri       Rhodes
44       Sherry     Marshall
45       Teresa       Rogers
46     Terrance        Roush
47     Terrence    Gunderson
48        Terri      Vasquez
49        Terry      Carlson
50        Terry      Grissom
51      Theresa       Watson
52        Tyler         Wren
53      Valerie        Black
54         Vera        Mccoy
55       Vernon        Chapa
56     Veronica        Stone
57       Walter     Perryman

In [12]:
sql = """
SELECT 
  first_name, 
  last_name 
FROM 
  customer 
WHERE 
  first_name LIKE '_her%' 
ORDER BY 
  first_name;
"""

run_sql(cursor, sql)

  first_name last_name
0     Cheryl    Murphy
1     Sherri    Rhodes
2     Sherry  Marshall
3    Theresa    Watson

In [13]:
sql = """
SELECT 
  first_name, 
  last_name 
FROM 
  customer 
WHERE 
  first_name NOT LIKE 'Jen%' 
ORDER BY 
  first_name;
"""

run_sql(cursor, sql)

    first_name last_name
0        Aaron     Selby
1         Adam     Gooch
2       Adrian     Clary
3        Agnes    Bishop
4         Alan      Kahn
..         ...       ...
591     Willie    Howell
592      Wilma  Richards
593    Yolanda    Weaver
594     Yvonne   Watkins
595    Zachary      Hite

[596 rows x 2 columns]

In [15]:
sql = """
SELECT 
  first_name, 
  last_name 
FROM 
  customer 
WHERE 
  first_name ILIKE 'BAR%';
"""

sql2 = """
SELECT 
  first_name, 
  last_name 
FROM 
  customer 
WHERE 
  first_name LIKE 'BAR%';
"""

run_sql(cursor, sql2)

Empty DataFrame
Columns: [first_name, last_name]
Index: []

In [16]:
sql = """
SELECT 
  first_name, 
  last_name 
FROM 
  customer 
WHERE 
  first_name ~~ 'Dar%' 
ORDER BY 
  first_name;
"""

run_sql(cursor, sql)

  first_name last_name
0    Darlene      Rose
1    Darrell     Power
2     Darren   Windham
3     Darryl  Ashcraft
4      Daryl     Larue

需要查询的数据中包括了 % 或者 _ 的情况是，可以使用 `ESCAPE`

```
string LIKE pattern ESCAPE escape_character;
```

In [17]:
table_sql = """
CREATE TABLE t(
   message text
);
"""

data_sql = """
INSERT INTO t(message) 
VALUES('The rents are now 10% higher than last month'), 
      ('The new film will have _ in the title');
"""

In [18]:
cursor.execute(table_sql)
cursor.execute(data_sql)

In [19]:
sql = """
SELECT * FROM t 
WHERE message LIKE '%10$%%' ESCAPE '$';
"""

run_sql(cursor, sql)

                                        message
0  The rents are now 10% higher than last month

IS NULL

In [20]:
sql = """
SELECT 
  address, 
  address2 
FROM 
  address 
WHERE 
  address2 IS NULL;
"""

run_sql(cursor, sql)

                address address2
0     47 MySakila Drive     None
1    28 MySQL Boulevard     None
2     23 Workhaven Lane     None
3  1411 Lillydale Drive     None

In [21]:
sql = """
SELECT 
  address, 
  address2 
FROM 
  address 
WHERE 
  address2 IS NOT NULL;
"""

run_sql(cursor, sql)

# 给出了不符合预期的查询结果。因为 address2 是空字符串。如果要匹配 NOT NULL，需要将空字符串更新为 NULL

                      address address2
0              1913 Hanoi Way
1            1121 Loja Avenue
2           692 Joliet Street
3            1566 Inegl Manor
4             53 Idfu Parkway
..                        ...      ...
594       844 Bucuresti Place
595  1101 Bucuresti Boulevard
596    1103 Quilmes Boulevard
597       1331 Usak Boulevard
598      1325 Fukuyama Street

[599 rows x 2 columns]